Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F41A.tmx
Source language: en_us
Languages: zh_cn

source: The History Of 7 Bizarre English Words
zh_cn: 七个英语中的怪异词的历史故事

source: If you can tell the history of the world in 100 objects, as the British Museum's Neil MacGregor did in 2010, then it ought to be possible to tell the history of a language in a similar number.
zh_cn: 如果你可以像大英博物馆馆长麦克格瑞格一样，用一百个名词来讲述世界历史，那你或许也可以用类似数量的词语来讲述语言的历史。

source: But, as with objects, it isn't enough for each word to be interesting in its own right. It has to tell a story.
zh_cn: 但是，说到名词，它本身并不够有趣，必须是有一个与之相关的故事。

source: And each of these individual stories should add up to the history of the English language as a whole.
zh_cn: 这一个个名词的故事就组成了英语的历史。

source: I needed principles on which to base my selection.
zh_cn: 在选择词汇的时候我有自己的标准。

source: The obvious one is chronological.
zh_cn: 最明显的一条就是年代顺序。

source: The history of English is traditionally divided into periods: Old English, from the arrival of the Anglo-Saxons in 449 AD until the 11th century; Middle English from then until the 15th century; Early Modern English from then until the 18th century; and Modern English thereafter.
zh_cn: 英语的历史传统上被分为以下时期：古代英语（从公园449年安哥拉撒克逊人的到来至公元十一世纪），中古英语时期（从公元十一世纪到十五世纪），现代英语早期（从15世纪到18世纪），现代英语时期（18世纪至今）。

source: It's important to choose words that show the passage of time in this way, and give us a real insight into social history.
zh_cn: 用这种方法来选择代表历史的词语是很重要的，藉此我们可以对社会历史有一个真实的认识。

source: But, at any one time, English is a kaleidoscope of styles, genres, and dialects. In particular, the words we use when we speak aren't the same as those we use when we write.
zh_cn: 但是，在任何时候，英语在其风格、文体、方言各方面都是千变万化的，尤其是那些文不对言的词汇。

source: Far more people speak a nonstandard variety of English than speak standard English, and their story must be told too.
zh_cn: 事实上，说非标准英语的人要比说标准英语的人多得多，因此，这些词汇的故事也应该讲一讲。

source: Nor must we neglect the commonest everyday words, such as slang, cant, and taboo words.
zh_cn: 我们也不能忽视了每天都用的日常词汇，比如说俚语、黑话、禁语等。

source: There can't be any pussy-footing, if you're a serious linguist.
zh_cn: 如果你是一个严肃的语言学家，这些都是不容略过的。

source: The rude words are just as much a part of our linguistic history.
zh_cn: 那些粗话也是我们语言历史的一部分。

source: Professional words, such as those associated with the law, medicine, religion, and academia, provide another historical strand.
zh_cn: 还有就是那些与法律、医药、宗教、学术或其他历史分支有关的专业词汇。

source: Of the million+ words in English, three-quarters belong to the various domains of science and technology.
zh_cn: 在英语里上百万的词汇中，有三分之二是属于科学和技术的各个领域的。

source: And the global spread of English has to be represented.
zh_cn: 而且英语在世界范围内的传播也有其代表性。

source: Around a third of the world's population use English now, and one of the consequences has been the emergence of international dialects, each with its own local vocabulary.
zh_cn: 现在，世界上三分之一的人口在用英语，其产生的结果之一就是国际性方言的出现，每一种都带有当地的词汇特色。
